---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructuralElementMayNotBeSupported
source: html/4705343b-063f-b292-0b5f-b5bdb49652f3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.StructuralElementMayNotBeSupported Property

Structural Element may not be supported -- verify support for Element.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralElementMayNotBeSupported { get; }
```